example/cylinder/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    "(\w*X|\w*Y|\w*Z)"
    {
        type            fixedValue;
        value           uniform 298;
    }

    "(\w*_fluid)"
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 298;
        Tnbr            T;
        neighbourFieldName T;
        kappa           fluidThermo;
        kappaName       none;
    }
}


// ************************************************************************* //
