example/cylinder/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ( 0 0 0 );

boundaryField
{
    "(\w*X|\w*Y|\w*Z)"
    {
	    type		pressureInletOutletVelocity;
	    phi	    	phi;
	    rho    		rho;
	    value		uniform (0 0 0);
    } 

    "(\w*_fluid)"
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
}


// ************************************************************************* //
