example/cylinder/0/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
 
    "(\w*X|\w*Y|\w*Z)"
    {
    	type		totalPressure;
	    p0		    uniform 1e5;
	    U		    U;
	    phi		    phi;
	    rho    		rho;
	    psi    		none;
	    gamma		1;
    }

    "(\w*_fluid)"
    {
        type        fixedFluxPressure;
	    value		uniform 1e5;
    }
}


// ************************************************************************* //
