example/cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    maxX
    {
        type            patch;
        nFaces          10240;
        startFace       2705310;
    }
    minX
    {
        type            patch;
        nFaces          10240;
        startFace       2715550;
    }
    minY
    {
        type            patch;
        nFaces          10240;
        startFace       2725790;
    }
    maxY
    {
        type            patch;
        nFaces          10240;
        startFace       2736030;
    }
    maxZ
    {
        type            patch;
        nFaces          6400;
        startFace       2746270;
    }
    minZ
    {
        type            patch;
        nFaces          6400;
        startFace       2752670;
    }
)

// ************************************************************************* //
