example/cylinder/constant/solid/sigma
(
290 3102
300 3102
350 3102
400 3102
)
