example/cylinder/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver          PCG
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;

        smoother         GaussSeidel;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-6;
        relTol           0;
    }

    U
    {
        solver           PBiCG;
        preconditioner	 DILU;
        tolerance        1e-6;
        relTol           0.1;
    }

    UFinal
    {
        $U;
        tolerance        1e-6;
        relTol           0;
    }

    h
    {
	solver		PBiCG;
	preconditioner	DILU;
	tolerance	1e-6;
	relTol		0.1;
    }

    hFinal
    {
	$h
	tolerance	1e-6;
	relTol		0;
    }
}

SIMPLE
{
    momentumPredictor	on;
    nCorrectors         1;
    nNonOrthogonalCorrectors 1;
    rhoMin		rhoMin [1 -3 0 0 0] 1;
    rhoMax		rhoMax [1 -3 0 0 0] 1.2;
    pRefPoint		(0 0 -0.0241255);
    pRefValue		1e5;
}

relaxationFactors
{
    fields
    {
	    p		    0.7;
    }

    equations
    {
	    "U.*"		0.3;
    }
}

// ************************************************************************* //
